data-importer/app/controllers/data_imports_controller.rb

  def index
    @imports = DataImport.all
---
SELECT "data_imports".* FROM "data_imports"

  def show
    @import = DataImport.find(params[:id])
---
SELECT "data_imports".* FROM "data_imports" WHERE "data_imports"."id" = ? LIMIT 1  [["id", "1"]]