data-importer/app/controllers/sessions_controller.rb

  def create
    authenticate_with_open_id do |auth, url|
      if auth.successful?
        normalized_url = URI.parse(url).normalize.to_s
        user = User.find_or_create_by(identity_url: normalized_url)
---
INSERT INTO "users" ("created_at", "remember_token", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 18 Jan 2014 09:27:32 UTC +00:00], ["remember_token", "gbgNbsMUyMeYrWfo6V_UcQ"], ["updated_at", Sat, 18 Jan 2014 09:27:32 UTC +00:00]]