data-importer/app/controllers/sessions_controller.rb

  def create
    authenticate_with_open_id do |auth, url|
      if auth.successful?
        normalized_url = URI.parse(url).normalize.to_s
        user = User.find_or_create_by(identity_url: normalized_url)
---
INSERT INTO "users" ("created_at", "identity_url", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 16 Jan 2014 23:49:22 UTC +00:00], ["identity_url", "https://profiles.google.com/103205564732382069042"], ["updated_at", Thu, 16 Jan 2014 23:49:22 UTC +00:00]]
SELECT "users".* FROM "users" WHERE "users"."identity_url" = 'https://profiles.google.com/103205564732382069042' ORDER BY "users"."id" ASC LIMIT 1